{
  "version": "Notebook/1.0",
  "items": [
    {
      "type": 9,
      "content": {
        "version": "KqlParameterItem/1.0",
        "parameters": [
          {
            "id": "d8165cd4-7fab-40b7-a05c-2e11f191f003",
            "version": "KqlParameterItem/1.0",
            "name": "RelationshipTypes",
            "label": "Relationship Types",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "let ExtraRelationShips = datatable(Name:string)\r\n[\r\n    'Incident'\r\n];\r\nUBHrelationships_CL\r\n| distinct Label_s\r\n| project Name = Label_s\r\n| union ExtraRelationShips",
            "value": [
              "AZContains",
              "AZUserAccessAdministrator",
              "AZContributor",
              "AZOwns",
              "MemberOf",
              "AZResetPassword",
              "AZRunsAs",
              "AZKeyVaultContributor",
              "AZVMContributor",
              "AZGlobalAdmin",
              "AZPrivilegedRoleAdmin"
            ],
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 2592000000
            },
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces"
          },
          {
            "id": "5d6d52d5-0383-4f90-81ec-e7ce865071e2",
            "version": "KqlParameterItem/1.0",
            "name": "StartNodeType",
            "label": "Start Node Type",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "UBHrelationships_CL\r\n| distinct Start_labels_s\r\n| project Name = parse_json(Start_labels_s)[0]",
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 2592000000
            },
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "value": [
              "AZUser",
              "AZServicePrincipal"
            ]
          },
          {
            "id": "8b585164-301b-473c-b896-e0e31df4dcfa",
            "version": "KqlParameterItem/1.0",
            "name": "EndNodeType",
            "label": "End Node Type",
            "type": 2,
            "multiSelect": true,
            "quote": "'",
            "delimiter": ",",
            "query": "UBHrelationships_CL\r\n| distinct End_labels_s\r\n| project Name = parse_json(End_labels_s)[0]",
            "typeSettings": {
              "additionalResourceOptions": [
                "value::all"
              ],
              "showDefault": false
            },
            "timeContext": {
              "durationMs": 2592000000
            },
            "defaultValue": "value::all",
            "queryType": 0,
            "resourceType": "microsoft.operationalinsights/workspaces",
            "value": [
              "AZKeyVault"
            ]
          }
        ],
        "style": "pills",
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces"
      },
      "name": "parameters - 1"
    },
    {
      "type": 3,
      "content": {
        "version": "KqlItem/1.0",
        "query": "let mRelatedEventNodes = SecurityAlert\r\n| project  Id_d = todouble(substring(replace_regex(SystemAlertId, @'[a-zA-Z-]',\"\"),0,5)), Name=\"Incident\", Labels_s = DisplayName, Color='pink' ;\r\nlet mRelatedEventsRels = SecurityAlert\r\n| mv-expand parse_json(Entities)\r\n| extend EntityName = toupper(tostring(Entities[\"DisplayName\"]))\r\n| where EntityName != \"\"\r\n| join kind=leftouter  UBHnodes_CL on $left.EntityName == $right.Properties_azname_s\r\n| project SystemAlertId, Start_id_s = substring(tostring(replace_regex(SystemAlertId, @'[a-zA-Z-]',\"\")),0,5), End_id_s = tostring(toint(Id_d)), Label_s = \"Incident\", Start_labels_s =AlertSeverity, End_labels_s=Labels_s\r\n| where End_id_s != \"\";\r\nlet mRelationships = UBHrelationships_CL\r\n| where parse_json(Start_labels_s)[0] in ({StartNodeType})\r\n| where parse_json(End_labels_s)[0] in ({EndNodeType})\r\n| project Start_id_s, End_id_s, Label_s, Start_labels_s, End_labels_s\r\n| union (mRelatedEventsRels)\r\n| where Label_s in ({RelationshipTypes});\r\nlet mNodeIdsInRels = mRelationships\r\n| distinct Start_id_s\r\n| project NodeId = todouble(Start_id_s)\r\n| union (mRelationships\r\n| distinct End_id_s\r\n| project NodeId = todouble(End_id_s))\r\n| distinct NodeId;\r\nlet mNodes = UBHnodes_CL\r\n| extend Color = iff(Labels_s contains \"AZUser\", 'FF0000', iff(Labels_s contains \"AZVM\", '00FF00', iff(Labels_s contains \"AZKeyVault\", '0000FF', iff(Labels_s contains \"AZServicePrincipal\", '0FF000', \"\"))))\r\n| extend Name = iff(Properties_azname_s == \"\",Properties_objectid_g, Properties_azname_s)\r\n| union (mRelatedEventNodes)\r\n| where Id_d in (mNodeIdsInRels);\r\nmNodes\r\n| union (mRelationships)",
        "size": 3,
        "timeContext": {
          "durationMs": 2592000000
        },
        "queryType": 0,
        "resourceType": "microsoft.operationalinsights/workspaces",
        "visualization": "graph",
        "graphSettings": {
          "type": 0,
          "topContent": {
            "columnMatch": "Label_s",
            "formatter": 1
          },
          "centerContent": {
            "columnMatch": "Name",
            "formatter": 1,
            "numberFormat": {
              "unit": 17,
              "options": {
                "style": "decimal",
                "maximumFractionDigits": 2,
                "maximumSignificantDigits": 3
              }
            }
          },
          "bottomContent": {
            "columnMatch": "Labels_s"
          },
          "nodeIdField": "Id_d",
          "sourceIdField": "Start_id_s",
          "targetIdField": "End_id_s",
          "graphOrientation": 3,
          "showOrientationToggles": false,
          "edgeLabel": "Label_s",
          "nodeSize": null,
          "staticNodeSize": 100,
          "colorSettings": {
            "nodeColorField": "Color",
            "type": 1,
            "colorPalette": "cool",
            "emptyValueColor": "gray"
          },
          "hivesMargin": 5
        }
      },
      "name": "query - 0"
    }
  ],
  "fromTemplateId": "sentinel-UserWorkbook",
  "$schema": "https://github.com/Microsoft/Application-Insights-Workbooks/blob/master/schema/workbook.json"
}